; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph2 - mode
	spectrograph3 - mode
	infrared0 - mode
	image1 - mode
	Star5 - direction
	GroundStation6 - direction
	Star1 - direction
	Star4 - direction
	Star0 - direction
	Star3 - direction
	Star2 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph3)
	(supports instrument0 image1)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star0)
	(supports instrument3 image1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(have_image Star7 thermograph2)
	(have_image Star8 image1)
	(have_image Phenomenon9 thermograph2)
	(have_image Star10 infrared0)
	(have_image Star11 infrared0)
))

)

; plan
1. (turn_to satellite1 star0 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star0)
   goals met: 0 of 5
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 5
4. (turn_to satellite1 star11 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star11)
   goals met: 0 of 5
5. (take_image satellite1 star11 instrument2 infrared0)
   added: (have_image star11 infrared0)
   goals met: 1 of 5
6. (turn_to satellite1 star10 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star10)
   goals met: 1 of 5
7. (take_image satellite1 star10 instrument2 infrared0)
   added: (have_image star10 infrared0)
   goals met: 2 of 5
8. (turn_to satellite1 phenomenon9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 phenomenon9)
   goals met: 2 of 5
9. (take_image satellite1 phenomenon9 instrument2 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 3 of 5
10. (turn_to satellite1 star7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star7)
   goals met: 3 of 5
11. (take_image satellite1 star7 instrument2 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 4 of 5
12. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 4 of 5
13. (take_image satellite1 star8 instrument2 image1)
   added: (have_image star8 image1)
   goals met: 5 of 5
